# IMPORTING LIBRARIES

In [7]:
# Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as st
%matplotlib inline

# LOADING DATASETS

In [8]:
# Load datasets 
df_demo = pd.read_csv(r"C:\Users\joann\OneDrive - University of Twente\Desktop\IRONHACK\CourseWork\Week5\WK5Project\Datasets\df_final_demo.txt")

In [9]:
# Load datasets 
df_experiment_clients = pd.read_csv(r"C:\Users\joann\OneDrive - University of Twente\Desktop\IRONHACK\CourseWork\Week5\WK5Project\Datasets\df_final_experiment_clients.txt")

In [10]:
# Load datasets 
df_web_data_pt_1 = pd.read_csv(r"C:\Users\joann\OneDrive - University of Twente\Desktop\IRONHACK\CourseWork\Week5\WK5Project\Datasets\df_final_web_data_pt_1.txt")

In [11]:
# Load datasets 
df_web_data_pt_2 = pd.read_csv(r"C:\Users\joann\OneDrive - University of Twente\Desktop\IRONHACK\CourseWork\Week5\WK5Project\Datasets\df_final_web_data_pt_2.txt")

# EXPLORING ALL DATASETS

In [12]:
print("df demo Datahead")
df_demo

df demo Datahead

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [13]:
print("df experiment clients Datahead")
df_experiment_clients

df experiment clients Datahead

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [14]:
print("df web data pt_1 Datahead")
df_web_data_pt_1

df web data pt_1 Datahead

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
343136,2443347,465784886_73090545671,136329900_10529659391_316129,confirm,2017-03-31 15:15:46
343137,2443347,465784886_73090545671,136329900_10529659391_316129,step_3,2017-03-31 15:14:53
343138,2443347,465784886_73090545671,136329900_10529659391_316129,step_2,2017-03-31 15:12:08
343139,2443347,465784886_73090545671,136329900_10529659391_316129,step_1,2017-03-31 15:11:37
343140,2443347,465784886_73090545671,136329900_10529659391_316129,start,2017-03-31 15:10:47

In [15]:
print("df web data pt_2 Datahead")
df_web_data_pt_2

df web data pt_2 Datahead

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [16]:
print("Summary statistics for df_demo:")
df_demo.describe()

Summary statistics for df_demo:

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,num_accts,bal,calls_6_mnth,logons_6_mnth
count,7.060900e+04,70595.000000,70595.000000,70594.000000,70595.000000,7.059500e+04,70595.000000,70595.000000
mean,5.004992e+06,12.052950,150.659367,46.442240,2.255528,1.474452e+05,3.382478,5.566740
std,2.877278e+06,6.871819,82.089854,15.591273,0.534997,3.015087e+05,2.236580,2.353286
min,1.690000e+02,2.000000,33.000000,13.500000,1.000000,1.378942e+04,0.000000,1.000000
25%,2.519329e+06,6.000000,82.000000,32.500000,2.000000,3.734683e+04,1.000000,4.000000
50%,5.016978e+06,11.000000,136.000000,47.000000,2.000000,6.333290e+04,3.000000,5.000000
75%,7.483085e+06,16.000000,192.000000,59.000000,2.000000,1.375449e+05,6.000000,7.000000
max,9.999839e+06,62.000000,749.000000,96.000000,8.000000,1.632004e+07,7.000000,9.000000

In [17]:
print("Summary statistics for df_experiment_clients:")
df_experiment_clients.describe()

Summary statistics for df_experiment_clients:

          client_id
count  7.060900e+04
mean   5.004992e+06
std    2.877278e+06
min    1.690000e+02
25%    2.519329e+06
50%    5.016978e+06
75%    7.483085e+06
max    9.999839e+06

In [18]:
print("Summary statistics for df_web_data_pt_1:")
df_web_data_pt_1.describe()

Summary statistics for df_web_data_pt_1:

          client_id
count  3.431410e+05
mean   4.996097e+06
std    2.875839e+06
min    1.690000e+02
25%    2.506067e+06
50%    5.007915e+06
75%    7.468519e+06
max    9.999839e+06

In [19]:
print("Summary statistics for df_web_data_pt_2:")
df_web_data_pt_2.describe()

Summary statistics for df_web_data_pt_2:

          client_id
count  4.122640e+05
mean   5.028227e+06
std    2.881828e+06
min    3.360000e+02
25%    2.533952e+06
50%    5.056314e+06
75%    7.516792e+06
max    9.999875e+06

In [20]:
print("Data types of columns in df_demo:")
df_demo.dtypes

Data types of columns in df_demo:

client_id             int64
clnt_tenure_yr      float64
clnt_tenure_mnth    float64
clnt_age            float64
gendr                object
num_accts           float64
bal                 float64
calls_6_mnth        float64
logons_6_mnth       float64
dtype: object

In [21]:
print("Data types of columns in df_experiment_clients:")
df_experiment_clients.dtypes

Data types of columns in df_experiment_clients:

client_id     int64
Variation    object
dtype: object

In [22]:
print("Data types of columns in df_web_data_pt_1:")
df_web_data_pt_1.dtypes

Data types of columns in df_web_data_pt_1:

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [23]:
print("Data types of columns in df_web_data_pt_2:")
df_web_data_pt_2.dtypes

Data types of columns in df_web_data_pt_2:

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [24]:
print("Null values in df_demo:")
df_demo.isnull().sum()

Null values in df_demo:

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [25]:
print("Null values in df_experiment_clients:")
print(df_experiment_clients.isnull().sum())

Null values in df_experiment_clients:
client_id        0
Variation    20109
dtype: int64

In [26]:
print("Null values in df_web_data_pt_1:")
print(df_web_data_pt_1.isnull().sum())

Null values in df_web_data_pt_1:
client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [27]:
print("Null values in df_web_data_pt_2:")
print(df_web_data_pt_2.isnull().sum())

Null values in df_web_data_pt_2:
client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [28]:
# Check for duplicates
print("Number of duplicates in df_demo:", df_demo.duplicated().sum())
print("Number of duplicates in df_experiment_clients:", df_experiment_clients.duplicated().sum())
print("Number of duplicates in df_web_data_pt_1:", df_web_data_pt_1.duplicated().sum())
print("Number of duplicates in df_web_data_pt_2:", df_web_data_pt_2.duplicated().sum())

Number of duplicates in df_demo: 0
Number of duplicates in df_experiment_clients: 0
Number of duplicates in df_web_data_pt_1: 2095
Number of duplicates in df_web_data_pt_2: 8669

# Cleaning DF DEMO

In [29]:
unique_genders = df_demo['gendr'].unique()
print("Unique values of 'gender' in df_demo:", unique_genders)

Unique values of 'gender' in df_demo: ['U' 'M' 'F' nan 'X']

In [30]:
# Count occurrences of 'U' and 'X' in 'gendr' column
gender_counts = df_demo['gendr'].value_counts()

# Display the counts
print("Number of occurrences of 'U' in 'gendr' column:", gender_counts.get('U', 0))
print("Number of occurrences of 'X' in 'gendr' column:", gender_counts.get('X', 0))

Number of occurrences of 'U' in 'gendr' column: 24122
Number of occurrences of 'X' in 'gendr' column: 3

In [31]:
# Replace 'U' values with 'Unknown' and drop rows with 'X' values
df_demo_cleaned = df_demo.replace({'gendr': {'U': 'Unknown'}})
df_demo_cleaned = df_demo_cleaned[df_demo_cleaned['gendr'] != 'X']

# Drop rows with both 'U' and 'X' values
df_demo_dropped = df_demo[(df_demo['gendr'] != 'U') & (df_demo['gendr'] != 'X')]

# Displaying the first few rows of each DataFrame
print("DataFrame with 'Unknown' for 'U' and dropping 'X':")
print(df_demo_cleaned.head())

print("nDataFrame dropping rows with both 'U' and 'X':")
print(df_demo_dropped.head())

DataFrame with 'Unknown' for 'U' and dropping 'X':
   client_id  clnt_tenure_yr  clnt_tenure_mnth  clnt_age    gendr  num_accts  \
0     836976             6.0              73.0      60.5  Unknown        2.0
1    2304905             7.0              94.0      58.0  Unknown        2.0
2    1439522             5.0              64.0      32.0  Unknown        2.0
3    1562045            16.0             198.0      49.0        M        2.0
4    5126305            12.0             145.0      33.0        F        2.0

         bal  calls_6_mnth  logons_6_mnth
0   45105.30           6.0            9.0
1  110860.30           6.0            9.0
2   52467.79           6.0            9.0
3   67454.65           3.0            6.0
4  103671.75           0.0            3.0
nDataFrame dropping rows with both 'U' and 'X':
   client_id  clnt_tenure_yr  clnt_tenure_mnth  clnt_age gendr  num_accts  \
3    1562045            16.0             198.0      49.0     M        2.0
4    5126305            12.0             145.0      33.0     F        2.0
7     388801            30.0             361.0      57.5     M        5.0
8     285619            30.0             369.0      67.5     M        2.0
9    8198645            15.0             189.0      54.5     F        2.0

         bal  calls_6_mnth  logons_6_mnth
3   67454.65           3.0            6.0
4  103671.75           0.0            3.0
7  522498.72           1.0            4.0
8  299388.72           3.0            6.0
9  382303.83           6.0            9.0

In [32]:
# Drop missing numerical values from df_demo_cleaned by creating a copy
df_demo_cleaned = df_demo_cleaned.dropna(subset=['clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age', 'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth'])

# Reset index
df_demo_cleaned.reset_index(drop=True, inplace=True)

In [34]:
# Drop missing numerical values from df_demo_dropped by creating a copy
df_demo_dropped = df_demo_dropped.dropna(subset=['clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age', 'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth'])

# Reset index
df_demo_dropped.reset_index(drop=True, inplace=True)

In [36]:
print("Shape of df_demo_cleaned:", df_demo_cleaned.shape)
print("Shape of df_demo_dropped:", df_demo_dropped.shape)

Shape of df_demo_cleaned: (70591, 9)
Shape of df_demo_dropped: (46469, 9)

In [37]:
print("Missing values in df_demo_cleaned:")
print(df_demo_cleaned.isnull().sum())

print("\nMissing values in df_demo_dropped:")
print(df_demo_dropped.isnull().sum())

Missing values in df_demo_cleaned:
client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

Missing values in df_demo_dropped:
client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

# CLEANING DF experiment_clients

In [38]:
print("df experiment clients Datahead")
df_experiment_clients

df experiment clients Datahead

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [40]:
# Create a copy of df_experiment_clients
df_experiment_clients_cleaned = df_experiment_clients.copy()

# Fill null values in the 'Variation' column with 'not assigned'
df_experiment_clients_cleaned['Variation'].fillna('not assigned', inplace=True)

# Display the first few rows of the cleaned dataframe
print(df_experiment_clients_cleaned)

       client_id     Variation
0        9988021          Test
1        8320017          Test
2        4033851       Control
3        1982004          Test
4        9294070       Control
...          ...           ...
70604    2443347  not assigned
70605    8788427  not assigned
70606     266828  not assigned
70607    1266421  not assigned
70608    9895983  not assigned

[70609 rows x 2 columns]

C:\Users\joann\AppData\Local\Temp\ipykernel_21804\1943495069.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_experiment_clients_cleaned['Variation'].fillna('not assigned', inplace=True)

# CLEANING DF df_web_data_pt_1 and df_web_data_pt_2

In [41]:
# Combine df_web_data_pt_1 and df_web_data_pt_2 vertically
df_web_data_combined = pd.concat([df_web_data_pt_1, df_web_data_pt_2], ignore_index=True)

# Drop duplicates in case there are any
df_web_data_combined.drop_duplicates(inplace=True)

In [42]:
df_web_data_combined.shape

(744641, 5)

In [43]:
df_web_data_combined

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
755400,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
755401,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
755402,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
755403,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
755404,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [44]:
df_web_data_combined.duplicated().sum()

0

# Merging dataframes

Based on the project requirements and the analyses i merge certain dataframes.

1. Merging df_demo_cleaned and df_experiment_clients_cleaned:

Merging these dataframes would allow to analyze client demographics alongside their participation in the experiment. This could help us understand if there are any demographic differences between the test and control groups, which could impact the experiment outcomes.
We can merge these dataframes on the client_id column, which is common between them.

2. Merging df_demo_cleaned, df_experiment_clients_cleaned, and df_web_data_combined:

This merger would provide a comprehensive dataset containing both client demographics and their online behavior, along with their participation in the experiment. It would enable us to analyze how client demographics and online behavior relate to their participation in the experiment and potentially impact experiment outcomes. I merge these dataframes on the client_id column, which is common between them.

In [45]:
# Merging df_demo_cleaned and df_experiment_clients_cleaned
df_merged_demo_exp = pd.merge(df_demo_cleaned, df_experiment_clients_cleaned, on='client_id', how='inner')

# Merging df_merged_demo_exp with df_web_data_combined
df_final_merged = pd.merge(df_merged_demo_exp, df_web_data_combined, on='client_id', how='left')

In [46]:
df_merged_demo_exp

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth,Variation
0,836976,6.0,73.0,60.5,Unknown,2.0,45105.30,6.0,9.0,Test
1,2304905,7.0,94.0,58.0,Unknown,2.0,110860.30,6.0,9.0,Control
2,1439522,5.0,64.0,32.0,Unknown,2.0,52467.79,6.0,9.0,Test
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control
...,...,...,...,...,...,...,...,...,...,...
70586,7993686,4.0,56.0,38.5,Unknown,3.0,1411062.68,5.0,5.0,not assigned
70587,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0,not assigned
70588,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0,not assigned
70589,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0,not assigned
70590,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,not assigned

In [49]:
# Convert 'date_time' column to datetime objects
df_final_merged['date_time'] = pd.to_datetime(df_final_merged['date_time'])